app/Http/Helper/helper.php

select * from `currencies` where (`default` = '1') limit 1
---
    function default_currency(): Currency
    {
        $currency = Cache::remember(CacheKey::DEFAULT_CURRENCY->value, 24 * 60, function () {
            return Currency::where(function (Builder $query) {
                return $query->where('default', StatusEnum::true->status());
            })->first();

select `value`, `key` from `translations` where `code` = 'en'
insert into `translations` (`code`, `key`, `value`, `updated_at`, `created_at`) values ('en', 'short_description_is_required', 'Short Description is required', '2025-05-12 11:06:43', '2025-05-12 11:06:43')
---
    function translate($keyWord, $lang_code = null)
    {
        try {
            $lang_code = $lang_code ? $lang_code : App::getLocale();
            $lang_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($keyWord)));
            $translate_data = Cache::remember('translations-' . $lang_code, now()->addHour(), function () use ($lang_code) {
                return Translation::where('code', $lang_code)->pluck('value', 'key')->toArray();
            });
            if (!array_key_exists($lang_key, $translate_data)) {
                $translate_val = str_replace(array("\r", "\n", "\r\n"), "", $keyWord);
                Translation::create([
                    'code' => $lang_code,
                    'key'  => $lang_key,
                    'value' => $translate_val
                ]);