app/Http/Controllers/Seller/HomeController.php

select count(*) as aggregate from `support_tickets` where `seller_id` = 38
select count(*) as aggregate from `plan_subscriptions` where `seller_id` = 38
---
    public function dashboard()
    {
        $title   = translate('Seller dashboard');
        $seller  = Auth::guard('seller')->user();
        $data['physical'] = Product::sellerProduct()->physical()->where('seller_id', $seller->id)->count();
        $data['digital'] = Product::sellerProduct()->digital()->where('seller_id', $seller->id)->count();
        $data['withdraw_amount'] = Withdraw::where('seller_id', $seller->id)->approved()->sum('amount');
        $data['total_ticket'] = SupportTicket::where("seller_id", $seller->id)->count();

        $data['total_subscription'] = PlanSubscription::where('seller_id', $seller->id)->count();

select * from `transactions` where `seller_id` is not null and `seller_id` = 38 order by `id` desc limit 8
---
            });
        })->count();

        $transactions = Transaction::whereNotNull('seller_id')->where('seller_id', $seller->id)->orderBy('id', 'DESC')->take(8)->get();