app/Http/Controllers/Seller/ProductController.php

select * from `brands` where `brands`.`id` in (4)
select * from `categories` where `categories`.`id` in (13)
---
    public function index()
    {
        $title = translate('Manage product');
        $seller = Auth::guard('seller')->user();
        $products = Product::search()->sellerProduct()->physical()->where('seller_id', $seller->id)->orderBy('id', 'DESC')->with('category', 'brand', 'subCategory', 'order')->paginate(site_settings('pagination_number',10));

select `id`, `name` from `brands` where `status` = '1'
select `name`, `id` from `shipping_deliveries`
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)
select `products`.*, `product_taxes`.`tax_id` as `pivot_tax_id`, `product_taxes`.`product_id` as `pivot_product_id`, `product_taxes`.`amount` as `pivot_amount`, `product_taxes`.`type` as `pivot_type` from `products` inner join `product_taxes` on `products`.`id` = `product_taxes`.`product_id` where `product_taxes`.`tax_id` in (1, 2) and `product_id` = 17 and `products`.`deleted_at` is null
select `taxes`.*, `product_taxes`.`product_id` as `pivot_product_id`, `product_taxes`.`tax_id` as `pivot_tax_id`, `product_taxes`.`amount` as `pivot_amount`, `product_taxes`.`type` as `pivot_type` from `taxes` inner join `product_taxes` on `taxes`.`id` = `product_taxes`.`tax_id` where `product_taxes`.`product_id` in (17)
---
    public function edit($slug,$id)
    {


        $title = translate('Product update');
        $seller = Auth::guard('seller')->user();
        $taxes = Tax::active()->get();
        $brands = Brand::where('status', '1')->select('id', 'name')->get();
        $shippingDeliveries = ShippingDelivery::get(['name','id']);
        $categories = Category::where('status', '1')->select('id', 'name')->with('parent')->get();
        $product = Product::sellerProduct()->physical()->where('seller_id', $seller->id)->where('id', $id)->firstOrFail();

        $taxes = Tax::with(['products'=> function(BelongsToMany $q) use($product) :BelongsToMany{
            return $q->where('product_id', $product->id);
        }])->active()->get();

delete from `product_taxes` where `product_taxes`.`product_id` = 17
insert into `product_taxes` (`amount`, `product_id`, `tax_id`, `type`) values ('1200', 17, '1', '1'), ('1200', 17, '2', '1')
---
                array_push($taxes,$val);
            }

            $product->taxes()->detach();
            $product->taxes()->attach($taxes);

delete from `product_shipping_deliveries` where `product_id` = 17
---
            ProductGallery::imageStore($request, $galleryImage, $product->id);
        }

        ProductShippingDelivery::where('product_id',$product->id)->delete();

insert into `product_shipping_deliveries` (`product_id`, `shipping_delivery_id`, `uid`, `updated_at`, `created_at`) values (17, '1', '5tbQ-3zGDDXxK-tlZF', '2025-05-12 11:11:50', '2025-05-12 11:11:50')
---
                $shippingDeliveries = ShippingDelivery::pluck('id');

                foreach($shippingDeliveries as $value){
                    ProductShippingDelivery::create([
                        'product_id' => $product->id,
                        'shipping_delivery_id' => $value
                    ]);

insert into `product_shipping_deliveries` (`product_id`, `shipping_delivery_id`, `uid`, `updated_at`, `created_at`) values (17, '1', 'yBme-byPTFaNp-oBT5', '2025-05-12 11:16:50', '2025-05-12 11:16:50')
---
            }
            else{
                foreach($request->shipping_delivery_id as $value){
                    ProductShippingDelivery::create([
                        'product_id' => $product->id,
                        'shipping_delivery_id' => $value
                    ]);

select * from `products` where `products`.`id` = '17' and `products`.`deleted_at` is null limit 1
---
    public function stock_edit(Request $request)
    {

        $product = Product::findOrFail($request->id);