app/Http/Controllers/FrontendController.php

    public function index()
    {
        $title = translate('Home Page');
        $banners =  Cache::get(CacheKey::BANNERS->value);
        $now = Carbon::now()->toDateTimeString();
        $campaigns = Campaign:: with('products')->where('status','1')
                            ->where('start_time',"<=",$now)
                            ->where('end_time',">=",$now)->take(4)->get();
---
select * from `campaigns` where `status` = '1' and `start_time` <= '2025-05-12 09:17:38' and `end_time` >= '2025-05-12 09:17:38' limit 4