app/Providers/AppServiceProvider.php

            view()->composer('frontend.section.digital_product', function ($view) {
                $view->with([
                    'digital_products'=> Cache::remember(CacheKey::FRONTEND_DIGITAL_PRODUCTS->value,24 * 60,
                                            fn() =>         Product::with(['digitalProductAttribute','review'])
                                            ->digital()
                                            ->where(function ($query) {
                                                $query->whereNull('seller_id')
                                                    ->whereIn('status', [ProductStatus::NEW, ProductStatus::PUBLISHED])
                                                    ->orWhereNotNull('seller_id')
                                                    ->whereIn('status', [ProductStatus::PUBLISHED]);
                                            })
                                            ->inRandomOrder()
                                            ->take(8)
                                            ->get())
---
select * from `digital_product_attributes` where `digital_product_attributes`.`product_id` in (2, 6, 7) order by `created_at` desc

            view()->composer('frontend.section.flash_deal', function ($view) {
                $now = Carbon::now();

                $view->with([
                    'flashDeal' => FlashDeal::where('status','1')
                                        ->where('start_date',"<=",$now)
                                        ->where('end_date',">=",$now)->first()
                ]);
---
select * from `flash_deals` where `status` = '1' and `start_date` <= '2025-05-12 09:17:38' and `end_date` >= '2025-05-12 09:17:38' limit 1

                $view->with([
                    'brands'=>
                                  Cache::remember(CacheKey::TOP_BRANDS->value,24 * 60,
                                            fn() =>   Brand::with(['houseProduct'])
                                            ->where('status', '1')
                                            ->where('top', Brand::YES)
                                            ->orderBy('serial', 'ASC')
                                            ->get()),
---
select * from `brands` where `status` = '1' and `top` = 2 order by `serial` asc

            view()->composer(['frontend.section.top_category'], function ($view) {
                $view->with([
                    'top_categories'=>  Cache::remember(CacheKey::TOP_CATEGORIES->value,24 * 60,
                    fn() =>   Category::with(['houseProduct','product','houseSubCateProduct'])
                                        ->whereHas('physicalProduct')
                                        ->where('status', '1')
                                        ->where('top', '1')
                                        ->orderBy('serial', 'ASC')->get()),
                ]);
            });

            view()->composer('frontend.section.best_selling_product', function ($view) {
                $view->with([
                    'best_selling_products'=>Cache::remember(CacheKey::FRONTEND_BEST_SELLING_PRODUCTS->value,24 * 60,
                    fn() =>   Product::with(['gallery','review','brand','stock'])->physical()->published()->where('best_selling_item_status', '2')->inRandomOrder()->take(6)->get()),

                ]);
            });
---
select * from `categories` where exists (select * from `products` where `categories`.`id` = `products`.`category_id` and `product_type` = 102 and `products`.`deleted_at` is null) and `status` = '1' and `top` = '1' order by `serial` asc
select * from `products` where `products`.`category_id` in (1, 2, 3, 6, 9, 13, 15) and `products`.`deleted_at` is null
select * from `products` where `product_type` = 102 and `status` = 1 and `best_selling_item_status` = '2' and `products`.`deleted_at` is null order by RAND() limit 6
select * from `brands` where `brands`.`id` in (3, 4, 5, 6, 7)

                    'top_products'=>

                    Cache::remember(CacheKey::FRONTEND_TOP_PRODUCTS->value,24 * 60,
                                                fn() =>         Product::with(['gallery','review','brand','stock',])
                                                ->physical()
                                                ->published()
                                                ->top()
                                                ->inRandomOrder()
                                                ->take(6)
                                                ->get()),
---
select * from `brands` where `brands`.`id` in (2, 4, 5, 6, 7)