app/Http/Controllers/Admin/SellerController.php

select * from `products` where `products`.`seller_id` in (19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38)
select * from `sellers` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `sellers`
---
    public function index() :View
    {
        $title    = translate('Manage seller');
        $sellers  = Seller::search()->latest()->with('product', 'sellerShop')->paginate(site_settings('pagination_number',10));

select * from `sellers` where `sellers`.`id` = 38 limit 1
---
    public function login(int $id) :RedirectResponse
    {

        $seller = Seller::findOrFail($id);